In [1]:
import pandas as pd

In [2]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [3]:
df1.shape

(7, 3)

In [5]:
df1.head()

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male

In [6]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [8]:
df1.tail()#last five rows

      Name  Marks  Gender
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [9]:
df1.tail(3)# last 3 rows

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [10]:
df1.shape[0]

7

In [11]:
 df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [13]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [14]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [15]:
df1.isnull().sum(axis=1)#axis =1 means sum in rows wise

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [16]:
df1.isnull().sum(axis=0)#axis =0 means colunms wise

Name      0
Marks     0
Gender    0
dtype: int64

In [17]:
df1.describe()#describe the total statistics of the total int data types

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [18]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [20]:
df1['Gender'].unique()# unique values

array(['Male', 'Female'], dtype=object)

In [21]:
df1['Gender'].nunique()# sum ofunique values

2

In [23]:
df1['Gender'].value_counts()#Dispaly Count of unique values in gender column

Gender
Female    4
Male      3
Name: count, dtype: int64

In [1]:
#Find total number of students Having marks between 90 to 100 (inclusive) using between method

In [6]:
df1['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [7]:
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [8]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [10]:
len(df1[df1['Marks']>=90])

4

In [11]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [12]:
df1[df1['Marks'].between(90,100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [3]:
      df1['Marks'].min()

np.int64(83)

In [5]:
df1['Marks'].max()

np.int64(99)

In [7]:
int(df1['Marks'].mean())

92

In [8]:
#Apply Method

In [13]:
def marks(x):
    return x//2

In [14]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [15]:
df1['Half_Marks']=df1['Marks'].apply(marks)

In [17]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

df1

In [18]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [20]:
df1['Marks'].apply(lambda x:x//2+df1['Marks'].max())

0    148
1    143
2    148
3    142
4    144
5    140
6    148
Name: Marks, dtype: int64

In [22]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [23]:
#Map Function

In [25]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [26]:
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [27]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [28]:
Drop the colunm

SyntaxError: invalid syntax (3072777084.py, line 1)

In [29]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [33]:
df1.drop('Male_Female',axis=1)

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [35]:
df1 #Becuase we didn't use inplace so no changes were occur so use inplace makes changes permanent

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [36]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_Marks', 'Male_Female'], dtype='object')

In [37]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [38]:
#sorting by marks

In [39]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [41]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender  Half_Marks  Male_Female
2   Krisha     99  Female          49            0
6  Archana     99  Female          49            0
0  Priyang     98    Male          49            1
4   Parshv     90    Male          45            1
1   Aadhya     89  Female          44            0
3   Vedant     87    Male          43            1
5   Mittal     83  Female          41            0

In [42]:
#Display Name & Marks of the female students

In [43]:
df1

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [46]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [47]:
df1['Gender']=='Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [48]:
df1[df1['Gender']=='Female']

      Name  Marks  Gender  Half_Marks  Male_Female
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [49]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99